app/controllers/admin_controller.rb

SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.count