app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'cadibiss@gmail.com' LIMIT 1

  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE `users` SET `password_digest` = '$2a$10$BiMu5/wOFL.J4mkEpIx.oOd2sQjTe81IFVpNkgZALRdDuKoqtt2.S', `updated_at` = '2017-03-06 13:27:17' WHERE `users`.`id` = 5