app/controllers/sessions_controller.rb

  def create
    user = User.find_by(name: params[:name], surname: params[:surname])
---
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'Bernard' AND `users`.`surname` = '' LIMIT 1